// ConsoleApplication1.cpp : 此檔案包含 'main' 函式。程式會於該處開始執行及結束執行。
//

#include <iostream>
using namespace std;
int main()
{
	double a,b;
	cout << "輸入所得:";
	cin >> a;
	if (0 <= a && a <= 560000)
	{
		b = a * 0.05;
		cout << "你所得的級距在0~560000應納稅額" << b;
	}
	else if (560001 <= a && a <= 1260000)
	{
		b = (a * 0.12) - 39200;
			cout << "你所得的級距在560001~1260001應納稅額" << b;
	}
	else if (1260001 <= a && a <= 2520000)
	{
		b = (a * 0.2) - 140000;
			cout << "你所得的級距在1260001~2520000應納稅額" << b;
	}
	else if (2520001 <= a && a <= 4720000)
	{
		b = (a * 0.3) - 392000;
			cout << "你所得的級距在2520001~4720000應納稅額" << b;
	}
	else
	{
		b = (a * 0.4) - 864000;
			cout << "你所得的級距在4720001以上應納稅額" << b;
	}
	return 0;
	
}

// 執行程式: Ctrl + F5 或 [偵錯] > [啟動但不偵錯] 功能表
// 偵錯程式: F5 或 [偵錯] > [啟動偵錯] 功能表

// 開始使用的提示: 
//   1. 使用 [方案總管] 視窗，新增/管理檔案
//   2. 使用 [Team Explorer] 視窗，連線到原始檔控制
//   3. 使用 [輸出] 視窗，參閱組建輸出與其他訊息
//   4. 使用 [錯誤清單] 視窗，檢視錯誤
//   5. 前往 [專案] > [新增項目]，建立新的程式碼檔案，或是前往 [專案] > [新增現有項目]，將現有程式碼檔案新增至專案
//   6. 之後要再次開啟此專案時，請前往 [檔案] > [開啟] > [專案]，然後選取 .sln 檔案
