// 1110834022.cpp : 此檔案包含 'main' 函式。程式會於該處開始執行及結束執行。
//

#include <iostream>

using namespace std;

int main() {
    double income;

    cout << "輸入綜合所得淨額：";
    cin >> income;

    double tax;
    if (income <= 560000) {
        tax = income * 0.05;
    }
    else if (income <= 1260000) {
        tax = 560000 * 0.05 + (income - 560000) * 0.12;
    }
    else if (income <= 2520000) {
        tax = 560000 * 0.05 + (1260000 - 560000) * 0.12 + (income - 1260000) * 0.20;
    }
    else if (income <= 4720000) {
        tax = 560000 * 0.05 + (1260000 - 560000) * 0.12 + (2520000 - 1260000) * 0.20 + (income - 2520000) * 0.30;
    }
    else {
        tax = 560000 * 0.05 + (1260000 - 560000) * 0.12 + (2520000 - 1260000) * 0.20 + (4720000 - 2520000) * 0.30 + (income - 4720000) * 0.40;
    }

    cout << "綜合所得淨額： " << income << endl;
    cout << "合適的級距： ";
    if (income <= 560000) {
        cout << "0~560,000" << endl;
    }
    else if (income <= 1260000) {
        cout << "560,001~1,260,000" << endl;
    }
    else if (income <= 2520000) {
        cout << "1,260,001~2,520,000" << endl;
    }
    else if (income <= 4720000) {
        cout << "2,520,001~4,720,000" << endl;
    }
    else {
        cout << "4,720,001 以上" << endl;
    }
    cout << "應納稅額： " << tax << endl;

    return 0;
}

// 執行程式: Ctrl + F5 或 [偵錯] > [啟動但不偵錯] 功能表
// 偵錯程式: F5 或 [偵錯] > [啟動偵錯] 功能表

// 開始使用的提示: 
//   1. 使用 [方案總管] 視窗，新增/管理檔案
//   2. 使用 [Team Explorer] 視窗，連線到原始檔控制
//   3. 使用 [輸出] 視窗，參閱組建輸出與其他訊息
//   4. 使用 [錯誤清單] 視窗，檢視錯誤
//   5. 前往 [專案] > [新增項目]，建立新的程式碼檔案，或是前往 [專案] > [新增現有項目]，將現有程式碼檔案新增至專案
//   6. 之後要再次開啟此專案時，請前往 [檔案] > [開啟] > [專案]，然後選取 .sln 檔案
